#Сложение 
x = 7 + 12
print(x)


#вычитание
x = 40 - 11
print(x)



#Умножение
x = 5 * 2
print(x)



#Возведение в степень
x = 5**2
print(x)






#Целочисленное деление
x = 22 // 2
print(x)

y = 22 // 3
print(y)





#Получение остатка
x = 11 % 3
print(x)





#Деление
x = 20 / 2
print(x)


# Всё это переменные типа float
a = 2.345
b = 2.
c = 2.0
x = .07
y = 0.07 



#Фитнес-трекер ежедневно получает данные о расстоянии, которое прошёл пользователь. 

day_1 = 1.434
day_2 = 2.12
day_3 = 1.632
day_4 = 5.59
day_5 = 2.542
day_6 = 1.1
day_7 = 1.324

week_dist = 1000 * (day_1 + day_2 + day_3 + day_4 + day_5 + day_6 + day_7) / 1000
print(week_dist)


